Pruebas Minimas/Request WS/FV_CargarDocumentosElectronicosToeBillGenericFULLPDFCUFE.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ebil="http://schemas.datacontract.org/2004/07/eBillCore" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:FV_CargarDocumentosElectronicosToeBillGenericFULLPDFCUFE>
    <tem:FacCab>
        <ebil:AnoAprobacionRes>2019</ebil:AnoAprobacionRes>
        <ebil:CFD_LineCountNumeric>1</ebil:CFD_LineCountNumeric>
        <ebil:CFD_LineExtensionAmount>1000000</ebil:CFD_LineExtensionAmount>
        <ebil:CFD_ProfileExecutionID>2</ebil:CFD_ProfileExecutionID>
        <ebil:CFD_TaxExclusiveAmount>0.00</ebil:CFD_TaxExclusiveAmount>
        <ebil:CFD_TaxInclusiveAmount>1000000.00</ebil:CFD_TaxInclusiveAmount>
        <ebil:CFD_TaxPointDate>2021-08-20T15:51:52.220</ebil:CFD_TaxPointDate>
        <ebil:CFD_base_impo_total_nal>0</ebil:CFD_base_impo_total_nal>
        <ebil:CFD_campo_texto_16>R-PN</ebil:CFD_campo_texto_16>
        <ebil:CFD_campo_texto_28>571875</ebil:CFD_campo_texto_28>
        <ebil:CFD_campo_texto_9>sincorreo@sincorreo.com</ebil:CFD_campo_texto_9>
        <ebil:CFD_cantidad_dec_24>0</ebil:CFD_cantidad_dec_24>
        <ebil:CFD_total_ICA>0</ebil:CFD_total_ICA>
        <ebil:CFD_total_cargos>0</ebil:CFD_total_cargos>
        <ebil:CFD_total_descuentos>0</ebil:CFD_total_descuentos>
        <ebil:CREETotal>0</ebil:CREETotal>
        <ebil:CampoTexto4>FN</ebil:CampoTexto4>
        <ebil:CiudadDANE>11001</ebil:CiudadDANE>
        <ebil:CodVendedor></ebil:CodVendedor>
        <ebil:CodigoPostalCliente>111111</ebil:CodigoPostalCliente>
        <ebil:Condiciones_Pago>10</ebil:Condiciones_Pago>
        <ebil:ContactoCorreo>sincorreo@sincorreo.com</ebil:ContactoCorreo>
        <ebil:CorreoCliente>modelovip1ebill@gmail.com</ebil:CorreoCliente>
        <ebil:DepartamentoDANE>11</ebil:DepartamentoDANE>
        <ebil:Descuento>0</ebil:Descuento>
        <ebil:DigitoVerificaCliente>7</ebil:DigitoVerificaCliente>
        <ebil:DireccionCliente>CRA 63 NO 17-91</ebil:DireccionCliente>
        <ebil:EstiloFactura>332</ebil:EstiloFactura>
        <ebil:FV_RFI_Id_Regimen_Fiscal>2</ebil:FV_RFI_Id_Regimen_Fiscal>
        <ebil:FV_TDD_Code_TipoDocumentoDIAN>01</ebil:FV_TDD_Code_TipoDocumentoDIAN>
        <ebil:FV_TDO_Codigo_TipoOperacion>10</ebil:FV_TDO_Codigo_TipoOperacion>
        <ebil:FechaExpedicion>2021-08-20T00:00:00.000</ebil:FechaExpedicion>
        <ebil:FechaVencimiento>2021-11-20T00:00:00.000</ebil:FechaVencimiento>
        <ebil:FormaPago>2</ebil:FormaPago>
        <ebil:InfoAdicional>PRUEBA</ebil:InfoAdicional>
        <ebil:MonedaISO>COP</ebil:MonedaISO>
        <ebil:NitCliente>900306823</ebil:NitCliente>
        <ebil:NitEmpresa>900306823</ebil:NitEmpresa>
        <ebil:NombreCliente>FYM</ebil:NombreCliente>
        <ebil:NombreVendedor></ebil:NombreVendedor>
        <ebil:NumAprobacionRes>18760000001</ebil:NumAprobacionRes>
        <ebil:NumFactura>4000507</ebil:NumFactura>
        <ebil:OrderID>43333</ebil:OrderID>
        <ebil:PAI_ISO_3166>CO</ebil:PAI_ISO_3166>
        <ebil:Prefijo>SETT</ebil:Prefijo>
        <ebil:RetencionCREETotal>0</ebil:RetencionCREETotal>
        <ebil:SubTotal>0</ebil:SubTotal>
        <ebil:TIP_id_tipo_persona>2</ebil:TIP_id_tipo_persona>
        <ebil:TipoComprobante>1</ebil:TipoComprobante>
        <ebil:TipoContribuyente>0</ebil:TipoContribuyente>
        <ebil:TipoIDCliente>7</ebil:TipoIDCliente>
        <ebil:Total>1000000.00</ebil:Total>
        <ebil:TotalIVA>0.00</ebil:TotalIVA>
        <ebil:TotalRetICA>0</ebil:TotalRetICA>
        <ebil:TotalRetIVA>0</ebil:TotalRetIVA>
        <ebil:TotalRetencion>0</ebil:TotalRetencion>
        <ebil:Total_a_Pagar>1000000.00</ebil:Total_a_Pagar>
    </tem:FacCab>
    <tem:DetFac>
        <ebil:FV_CFDDetConexionInt>
            <ebil:CON_dato_decimal1>1000000.00</ebil:CON_dato_decimal1>
            <ebil:CON_dato_decimal2>2</ebil:CON_dato_decimal2>
            <ebil:CON_dato_decimal3>0.00</ebil:CON_dato_decimal3>
            <ebil:CON_dato_texto1>999</ebil:CON_dato_texto1>
            <ebil:CON_dato_texto2>Estandar de adopcion del contribuyente</ebil:CON_dato_texto2>
            <ebil:CON_unidad_medida_con>94</ebil:CON_unidad_medida_con>
            <ebil:Cantidad>2</ebil:Cantidad>
            <ebil:CodigoProducto>43</ebil:CodigoProducto>
            <ebil:CodigosString>43</ebil:CodigosString>
            <ebil:DescripcionProducto>Helado XD MAN</ebil:DescripcionProducto>
            <ebil:DescuentoConcepto>0</ebil:DescuentoConcepto>
            <ebil:IdConcepto>1</ebil:IdConcepto>
            <ebil:ItemReferencia>1</ebil:ItemReferencia>
            <ebil:ValorUnitario>500000</ebil:ValorUnitario>
            <ebil:con_recurrente>false</ebil:con_recurrente>
        </ebil:FV_CFDDetConexionInt>
    </tem:DetFac>
    <tem:Opciones>
        <ebil:ActualizaProductos>true</ebil:ActualizaProductos>
        <ebil:CalculaReteCree>false</ebil:CalculaReteCree>
        <ebil:CalculaReteFuente>false</ebil:CalculaReteFuente>
        <ebil:CalculaReteICA>false</ebil:CalculaReteICA>
        <ebil:CalculaReteIVA>false</ebil:CalculaReteIVA>
        <ebil:EmisionAutomatica>true</ebil:EmisionAutomatica>
        <ebil:FacturasSinAcuerdo>true</ebil:FacturasSinAcuerdo>
        <ebil:ModeloXAceptacion>false</ebil:ModeloXAceptacion>
        <ebil:NotasRelacionadas>false</ebil:NotasRelacionadas>
        <ebil:OrderControl>false</ebil:OrderControl>
        <ebil:TieneAcuerdosFisicos>true</ebil:TieneAcuerdosFisicos>
        <ebil:TokenConexion>0CA473A5-5699-4AAE-BEA5-BEAB6D7A5804</ebil:TokenConexion>
        <ebil:eBillAdmNumerosFactura>false</ebil:eBillAdmNumerosFactura>
    </tem:Opciones>
</tem:FV_CargarDocumentosElectronicosToeBillGenericFULLPDFCUFE>
   </soapenv:Body>
</soapenv:Envelope>
